/*
######################################################################################################################################################
# ファイル   : CriticalException.java
# 
#-----------------------------------------------------------------------------------------------------------------------------------------------------
# [修正履歴]
# V-001      : 2026/01/01                 Gamer-Iris   新規作成
# 
######################################################################################################################################################
*/
package com.gamer_iris.exception;

/**
 * システムの致命的なエラーを表すカスタム形式の例外クラス
 */
public class CriticalException extends RuntimeException {

    /**
     * メッセージのみを持つコンストラクタ
     * 
     * @param message エラー内容
     */
    public CriticalException(String message) {
        super(message);
    }

    /**
     * メッセージと原因例外を持つコンストラクタ
     * 
     * @param message エラー内容
     * @param cause   原因となる例外
     */
    public CriticalException(String message, Throwable cause) {
        super(message, cause);
    }

}
